In [1]:
%load_ext sql

In [10]:
%sql sqlite:///2016.db

u'Connected: None@2016.db'

In [17]:
%sql select count(distinct orispl_code) as num_plants, fuel_type, SUM(heat_input), SUM(CO2_MASS) from data group by fuel_type

Done.

[(44, u'Coal', 1828294021.6818595, 190078286.1859955),
 (14, u'Natural Gas', 113287674.59899981, 6733549.710999983),
 (1, u'Natural Gas, Pipeline Natural Gas', 182723.20099999988, 10859.062999999996),
 (1, u'Other Gas', 27517565.06299996, 1624003.4630000028),
 (195, u'Pipeline Natural Gas', 1373820199.4159188, 81557792.79700759),
 (1, u'Wood', 5528270.879999992, 576296.3999999982)]

In [16]:
%sql select count(distinct orispl_code) as num_plants, fuel_type, SUM(heat_input), SUM(CO2_MASS) from data group by fuel_type, state

Done.

[(42, 1828294021.6818595, 190078286.1859955, u'Coal'),
 (14, 113287674.59899981, 6733549.710999983, u'Natural Gas'),
 (1, 182723.20099999988, 10859.062999999996, u'Natural Gas, Pipeline Natural Gas'),
 (1, 27517565.06299996, 1624003.4630000028, u'Other Gas'),
 (192, 1373820199.4159188, 81557792.79700759, u'Pipeline Natural Gas'),
 (1, 5528270.879999992, 576296.3999999982, u'Wood')]